# 1.Пользователь вводит с клавиатуры два числа.
# показать все числа в указанном диапазоне.
# показать все нечетные числа в указанном диапазоне.
# показать все четные числа в указанном диапазоне.
# показать все числа в указанном диапазоне в порядке убывания.
# показать все нечетные числа в указанном диапазоне.
# посчитать сумму чисел в диапазоне, а также среднеарифметическое.
#
# Если границы диапазона указаны неправильно требуется произвести нормализацию границ.
# Например, пользователь ввел 33 и 13, требуется нормализация после
# которой начало диапазона станет равно 13, а конец 33.

# a = int(input("Введите 1 число: "))
# b = int(input("Введите 2 число: "))
# for i in range(a,b + 1):
#     print(i)
#
# c = 0
# e = 0
#
# for i in range(a,b):
#     if i % 2 != 0:
#         c = i
#         print("Не четные", c)
#     if i % 2 == 0:
#         e = i
#         print("Четные", e)
#
#
# for i in range(b, a - 1, - 1):
#     print("По убыванию", i)
#
# summ = 0
# for i in range(a, b + 1):
#         summ += i
#         print("Сумма : ", summ)


# 2.Пользователь вводит с клавиатуры число. Требуется посчитать факториал числа.
# Например, если введено 3, факториал числа 1*2*3 = 6. Формула для расчета
# факториала: n! = 1*2*3…*n, где n — число для расчета факториала.

# x = int(input("Введите число: "))
# factorial = 1
# for i in range(2, x + 1):
#     factorial *= i
#
#     print(factorial)

###########################################################################

# 3.Пользователь вводит с клавиатуры длину линии.
# Нужно отобразить на экране горизонтальную линию из *, указанной длины.
# Например, если было введено 7, тогда вывод на экран будет такой: *******.

# a = int(input("Введите число: "))
# print(a * "*")

################################################################################

# 4.Пользователь вводит с клавиатуры длину линии и символ для заполнения линии.
# Нужно отобразить на экране горизонтальную линию из введенного символа,
# указанной длины. Например, если было введено 5 и &, тогда вывод на экран будет такой: &&&&&.

# a = int(input("Введите число: "))
# b = input("Введите знак: "' ')
# print( a * b)

#################################################################################

# 5.Написать игру «Угадай число».
# Программа загадывает число в диапазоне от 1 до 500.
# Пользователь пытается его угадать. После каждой попытки программа выдает подсказки,
# больше или меньше его число загаданного.
# В конце программа выдает статистику: за сколько попыток угадано число,
# сколько времени это заняло. Предусмотреть выход при вводе 0 в случае,
# если пользователю надоело угадывать число.

# from random import randint
# n = randint(1,500)
# c = int(input("Угадайте число от1 до 500: "))
# while c != n:
#     c = int(input("Повторите попытку: "))
#     if c > n:
#         print("Введите больше число: ")
#     elif c < n:
#         print("Введите меньше число: ")
#     else:
#         print("Вы угадали: ")
#     print(n)
#     print(c)

############################################################################

# 6.Пользователь вводит с клавиатуры ширину и высоту прямоугольника.
# Требуется отобразить на экран заполненный прямоугольник с указанными высотой и шириной.
# Например, если пользователь ввёл высоту 3, а ширину 5 на экране будет выведено:
# *****
# *****
# *****
# А также отобразить на экран незаполненный прямоугольник
# (отображаются только границы прямоугольника). Размер длины и ширины равен введенным данным.
#
# a = int(input("Введите число: "))
# b = int(input("Введите число: "))
# c = "*"
# square = ''
# for i in range(a):
#     square = (c * b)
#     print(square)
# print("+" + b * "-" + "+")
# print(("|" + " " * b + "| \n") * a, end="")
# print("+" + b * "-" + "+")

###################################################################################

# 7.Написать программу, которая выводит на экран шахматную доску
# с заданным размером клеточки. Например, три,
# ***---***---***---***---
# ***---***---***---***---
# ***---***---***---***---
# ---***---***---***---***
# ---***---***---***---***
# ---***---***---***---***

# for i in range(3):
#     s1 = '***---***---***---***---'
#     print(s1)
# for i in range(3):
#     s2 = '---***---***---***---***'
#     print(s2)

############################################################################################
#
# 8.Написать программу, которая проверяет пользователя на знание таблицы умножения.
# Программа выводит на экран два числа, пользователь должен ввести их произведение.
# Вывести пользователю оценку его знаний.

# def user_input(message: str) -> int:
#     while True:
#         try:
#             x = int(input(message))
#             return x
#         except ValueError:
#             print('Что ты вводишь')
#
#
# fail = 0
# right = 0
# total = 0
#
# while total < 5:
#     first = user_input('Введи первое число: ')
#     second = user_input('Введи второе число: ')
#     answer = user_input('Твой ответ: ')
#     if answer != first * second:
#         right = 0
#         fail += 1
#         print('Неверно!')
#     else:
#         right += 1
#         total += 1
#         fail = 0
#         print('Правильно!')
#     if fail == 3:
#         print('Не верно ?')
#     if right == 3:
#         print('Ты мозг, ты близок к победе!')
# print(' 5 верных ответов!')






